tutorials/eulerVortex.twitch/eulerVortex.cyclic.twitch.moving/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler corrected;
}

gradSchemes
{
    default         Gauss linear corrected;
}

divSchemes
{
  default         Gauss linear corrected;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}






/*
fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
  //default         Gauss linear;
  //div(tauMC)      Gauss linear;
  default none;
  div(phi,U) Gauss upwind;
  div(phid,p) Gauss upwind;
  div(phi,K) Gauss linear;
  div(phi,h) Gauss upwind;
  div(phi,k) Gauss upwind;
  div(phi,epsilon) Gauss upwind;
  div(phi,R) Gauss upwind;
  div(phi,omega) Gauss upwind;
  div((rho*R))  Gauss linear;
  dir(R)  Gauss linear;
  div(U)   Gauss linear;
  //div()
  div(phiv,p)  Gauss linear;
  div(phi,e)   Gauss LUST grad(e);
}

laplacianSchemes
{
    default         Gauss linear corrected;

    //laplacian(diffusivity,cellMotionU) Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
    //reconstruct(rho) vanLeer;
    //reconstruct(U)  vanLeerV;
    //reconstruct(T)  vanLeer;
}

snGradSchemes
{
    default         corrected;
}

*/
// ************************************************************************* //
